In [3]:
#Installing Pandas
!pip install pandas

Requirement already satisfied: pandas in c:\users\sradha\anaconda3\lib\site-packages (1.3.4)
Requirement already satisfied: numpy>=1.17.3 in c:\users\sradha\anaconda3\lib\site-packages (from pandas) (1.20.3)
Requirement already satisfied: python-dateutil>=2.7.3 in c:\users\sradha\anaconda3\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2017.3 in c:\users\sradha\anaconda3\lib\site-packages (from pandas) (2021.3)
Requirement already satisfied: six>=1.5 in c:\users\sradha\anaconda3\lib\site-packages (from python-dateutil>=2.7.3->pandas) (1.16.0)

In [4]:
'''
-In arrays, tabular datas can't be stored.
-In arrays, heterogenous datas can't be stored.Only homogenous data are allowed.
-rows and columns renaming is not possible.
'''
#Data representation is better in pandas as compared to numpy

"\n-In arrays, tabular datas can't be stored.\n-In arrays, heterogenous datas can't be stored.Only homogenous data are allowed.\n-rows and columns renaming is not possible.\n"

In [5]:
import pandas as pd

In [5]:
#We have two data structures in pandas
# 1.Series-Used to represent 1D data-vector
# 2.Dataframes-Used to represent 2D data

### series

In [6]:
#Creating a series
#1.A list
name=["Rob","John","Sansa","Arya","Bran","Rickon"]

In [7]:
player_name=pd.Series(name)
print(player_name)
print(type(player_name))

0       Rob
1      John
2     Sansa
3      Arya
4      Bran
5    Rickon
dtype: object
<class 'pandas.core.series.Series'>

In [8]:
player_name.shape

(6,)

In [9]:
player_name.ndim

1

In [10]:
player_name.size

6

In [11]:
#Changing the index values
pd.Series(name,index=['a','b','c','d','e','f'])   #same index values as the number of data

a       Rob
b      John
c     Sansa
d      Arya
e      Bran
f    Rickon
dtype: object

In [12]:
#2.Using an array

In [13]:
import numpy as np

In [14]:
arr=np.array(name)
arr

array(['Rob', 'John', 'Sansa', 'Arya', 'Bran', 'Rickon'], dtype='<U6')

In [15]:
pd.Series(arr)

0       Rob
1      John
2     Sansa
3      Arya
4      Bran
5    Rickon
dtype: object

In [16]:
pd.Series(arr,index=[1,2,3,4,5,6])

1       Rob
2      John
3     Sansa
4      Arya
5      Bran
6    Rickon
dtype: object

In [17]:
#3.Using dictionary

In [18]:
data={'name_1':"Rob",'name_2':'John','name_3':'Arya'}   #Key will be the index and corresponding value will be value in dict
pd.Series(data)     #Index value can't be changed using index parameter label

name_1     Rob
name_2    John
name_3    Arya
dtype: object

In [19]:
pd.Series(data,index=[1,2,3,'name_1'])  #The index value which is not present as key, will give NaN value.

1         NaN
2         NaN
3         NaN
name_1    Rob
dtype: object

In [21]:
#Indexing in Series
# Indexing can be done in 2 ways:
#     1.By giving the index name you have selected.
#     2.By using the zero indexing

In [22]:
data=pd.Series(name,index=['a','b','c','d','e','f'])

In [23]:
data

a       Rob
b      John
c     Sansa
d      Arya
e      Bran
f    Rickon
dtype: object

In [24]:
data[0]    #0 indexing behind the scene

'Rob'

In [25]:
data['a']

'Rob'

In [26]:
#Slicing in Series
data[0:3]  #Start value in inclusive, and stop value is exclusive,step is bydefault 1.

a      Rob
b     John
c    Sansa
dtype: object

In [27]:
#custom indexing
data['a':'c']  #Both start and stop are inclusive.

a      Rob
b     John
c    Sansa
dtype: object

In [28]:
data=pd.Series(name,index=[10,20,30,40,50,60])

In [29]:
data

10       Rob
20      John
30     Sansa
40      Arya
50      Bran
60    Rickon
dtype: object

In [30]:
data[0:4]

10      Rob
20     John
30    Sansa
40     Arya
dtype: object

In [31]:
data[10:30]   #won't work if we use custom indexing as integers,only zero indexing will work as python will get confused.

Series([], dtype: object)

In [32]:
brics_country=['Brazil','Russia','India','China','South Africa']
brics_currency=['Real','Ruble','Rupee','Renminbi','Rand']
brics=dict(zip(brics_country,brics_currency))
brics

{'Brazil': 'Real',
 'Russia': 'Ruble',
 'India': 'Rupee',
 'China': 'Renminbi',
 'South Africa': 'Rand'}

In [33]:
data=pd.Series(brics)
data

Brazil              Real
Russia             Ruble
India              Rupee
China           Renminbi
South Africa        Rand
dtype: object

In [34]:
data=pd.Series(brics_country,index=brics_currency)
data

Real              Brazil
Ruble             Russia
Rupee              India
Renminbi           China
Rand        South Africa
dtype: object

In [35]:
data.index   #returns the indexes

Index(['Real', 'Ruble', 'Rupee', 'Renminbi', 'Rand'], dtype='object')

In [36]:
data.values  #returns the values

array(['Brazil', 'Russia', 'India', 'China', 'South Africa'], dtype=object)

In [37]:
#zero indexing
data[0:3:2]

Real     Brazil
Rupee     India
dtype: object

In [38]:
#custom indexing
data['Real':'Rupee':2]

Real     Brazil
Rupee     India
dtype: object

In [39]:
data[[0,1,3]]

Real        Brazil
Ruble       Russia
Renminbi     China
dtype: object

In [40]:
data[['Real','Ruble','Renminbi']]   #returns the indexes and values corresponding to the indexes

Real        Brazil
Ruble       Russia
Renminbi     China
dtype: object

In [41]:
len(data)

5

### Dataframes

In [42]:
pd.DataFrame()  #creates an empty DataFrame

Empty DataFrame
Columns: []
Index: []

In [43]:
ls

 Volume in drive C has no label.
 Volume Serial Number is B4D5-CE5A

 Directory of C:\Users\SRADHA\Desktop\python

02/21/2022  11:34 PM    <DIR>          .
02/21/2022  11:34 PM    <DIR>          ..
02/21/2022  07:50 PM    <DIR>          .ipynb_checkpoints
02/20/2022  11:11 PM    <DIR>          __pycache__
02/14/2022  01:05 PM    <DIR>          Advanced Python
01/29/2022  08:08 PM    <DIR>          Assignment
01/29/2022  08:08 PM    <DIR>          Assignment 1
02/21/2022  08:59 AM    <DIR>          Assignment 2
02/21/2022  09:03 AM    <DIR>          Assignment 3
02/15/2022  12:59 PM    <DIR>          Assignment 4
01/13/2022  07:27 PM             7,207 basic_1.ipynb
01/27/2022  09:51 AM            15,564 Class_02_Memory_Management_Python.ipynb
01/27/2022  09:51 AM            36,345 Class_03_Python_Components_Data_Types.ipynb
01/27/2022  09:52 AM            21,844 Class_04_Output_function_Boolean_Operator_String_Revision.ipynb
01/27/2022  09:52 AM            14,555 Class_05_Strings_in_Python.ipynb
01/27/2022  09:52 AM            22,803 Class_06_If_Conditions_Loops.ipynb
01/27/2022  09:53 AM            16,715 Class_07_While_Loop_Transfer_Statement.ipynb
01/27/2022  09:53 AM            24,592 Class_08_List_Tuple.ipynb
01/27/2022  09:53 AM            28,278 Class_09_List_Methods_Tuple.ipynb
01/31/2022  11:18 PM            30,304 Class_10_Tuple_Dictionary.ipynb
01/31/2022  11:51 PM            26,416 Class_11_Dictionary_Methods_Functions.ipynb
01/27/2022  10:20 AM            25,673 Class_12_Functions_part_1.ipynb
02/21/2022  10:27 AM    <DIR>          classes
02/21/2022  10:29 AM    <DIR>          datasets
02/20/2022  11:10 PM               751 maths.py
02/21/2022  07:52 PM               588 Matplotlib.ipynb
02/02/2022  08:10 PM             1,447 Modules_File Handling.ipynb
02/02/2022  08:07 PM                29 my_math.py
02/04/2022  09:06 PM               599 my_mod.py
02/21/2022  11:51 AM    <DIR>          Numpy and Pandas Assignment
02/20/2022  11:27 PM           802,593 Numpy.ipynb
02/21/2022  11:34 PM            32,521 Pandas.ipynb
01/29/2022  08:08 PM    <DIR>          Python
02/04/2022  08:38 PM             4,404 python.jpeg
01/06/2022  04:27 PM         4,386,903 Python_Weekday_Schedule.pdf
02/21/2022  07:52 PM               588 Seaborn.ipynb
02/20/2022  11:19 PM             6,694 Untitled.ipynb
02/14/2022  12:56 PM             3,767 Untitled1.ipynb
01/26/2022  11:34 AM                72 Untitled2.ipynb
02/02/2022  12:30 AM    <DIR>          w3resources
              25 File(s)      5,511,252 bytes
              15 Dir(s)  185,875,189,760 bytes free

In [44]:
pwd

'C:\\Users\\SRADHA\\Desktop\\python'

In [45]:
cd datasets/

C:\Users\SRADHA\Desktop\python\datasets

In [46]:
ls

 Volume in drive C has no label.
 Volume Serial Number is B4D5-CE5A

 Directory of C:\Users\SRADHA\Desktop\python\datasets

02/21/2022  10:29 AM    <DIR>          .
02/21/2022  10:29 AM    <DIR>          ..
02/21/2022  10:29 AM    <DIR>          datasets
               0 File(s)              0 bytes
               3 Dir(s)  185,875,173,376 bytes free

In [47]:
cd ..

C:\Users\SRADHA\Desktop\python

In [48]:
ls

 Volume in drive C has no label.
 Volume Serial Number is B4D5-CE5A

 Directory of C:\Users\SRADHA\Desktop\python

02/21/2022  11:34 PM    <DIR>          .
02/21/2022  11:34 PM    <DIR>          ..
02/21/2022  07:50 PM    <DIR>          .ipynb_checkpoints
02/20/2022  11:11 PM    <DIR>          __pycache__
02/14/2022  01:05 PM    <DIR>          Advanced Python
01/29/2022  08:08 PM    <DIR>          Assignment
01/29/2022  08:08 PM    <DIR>          Assignment 1
02/21/2022  08:59 AM    <DIR>          Assignment 2
02/21/2022  09:03 AM    <DIR>          Assignment 3
02/15/2022  12:59 PM    <DIR>          Assignment 4
01/13/2022  07:27 PM             7,207 basic_1.ipynb
01/27/2022  09:51 AM            15,564 Class_02_Memory_Management_Python.ipynb
01/27/2022  09:51 AM            36,345 Class_03_Python_Components_Data_Types.ipynb
01/27/2022  09:52 AM            21,844 Class_04_Output_function_Boolean_Operator_String_Revision.ipynb
01/27/2022  09:52 AM            14,555 Class_05_Strings_in_Python.ipynb
01/27/2022  09:52 AM            22,803 Class_06_If_Conditions_Loops.ipynb
01/27/2022  09:53 AM            16,715 Class_07_While_Loop_Transfer_Statement.ipynb
01/27/2022  09:53 AM            24,592 Class_08_List_Tuple.ipynb
01/27/2022  09:53 AM            28,278 Class_09_List_Methods_Tuple.ipynb
01/31/2022  11:18 PM            30,304 Class_10_Tuple_Dictionary.ipynb
01/31/2022  11:51 PM            26,416 Class_11_Dictionary_Methods_Functions.ipynb
01/27/2022  10:20 AM            25,673 Class_12_Functions_part_1.ipynb
02/21/2022  10:27 AM    <DIR>          classes
02/21/2022  10:29 AM    <DIR>          datasets
02/20/2022  11:10 PM               751 maths.py
02/21/2022  07:52 PM               588 Matplotlib.ipynb
02/02/2022  08:10 PM             1,447 Modules_File Handling.ipynb
02/02/2022  08:07 PM                29 my_math.py
02/04/2022  09:06 PM               599 my_mod.py
02/21/2022  11:51 AM    <DIR>          Numpy and Pandas Assignment
02/20/2022  11:27 PM           802,593 Numpy.ipynb
02/21/2022  11:34 PM            32,521 Pandas.ipynb
01/29/2022  08:08 PM    <DIR>          Python
02/04/2022  08:38 PM             4,404 python.jpeg
01/06/2022  04:27 PM         4,386,903 Python_Weekday_Schedule.pdf
02/21/2022  07:52 PM               588 Seaborn.ipynb
02/20/2022  11:19 PM             6,694 Untitled.ipynb
02/14/2022  12:56 PM             3,767 Untitled1.ipynb
01/26/2022  11:34 AM                72 Untitled2.ipynb
02/02/2022  12:30 AM    <DIR>          w3resources
              25 File(s)      5,511,252 bytes
              15 Dir(s)  185,875,173,376 bytes free

## Create a DataFrame

### 1.loading of a file

In [49]:
cd datasets/

C:\Users\SRADHA\Desktop\python\datasets

In [50]:
ls

 Volume in drive C has no label.
 Volume Serial Number is B4D5-CE5A

 Directory of C:\Users\SRADHA\Desktop\python\datasets

02/21/2022  10:29 AM    <DIR>          .
02/21/2022  10:29 AM    <DIR>          ..
02/21/2022  10:29 AM    <DIR>          datasets
               0 File(s)              0 bytes
               3 Dir(s)  185,875,165,184 bytes free

In [51]:
df=pd.read_csv("datasets/ted_data.csv")

In [52]:
pwd

'C:\\Users\\SRADHA\\Desktop\\python\\datasets'

In [53]:
df

,name_speaker,speaker_occupation,title,views,comments
0,Ken Robinson,Author/educator,Do schools kill creativity?,47227110,4553
1,Al Gore,Climate advocate,Averting the climate crisis,3200520,265
2,David Pogue,Technology columnist,Simplicity sells,1636292,124
3,Majora Carter,Activist for environmental justice,Greening the ghetto,1697550,200
4,Hans Rosling,Global health expert; data visionary,The best stats you've ever seen,12005869,593
5,Tony Robbins,Life coach; expert in leadership psychology,Why we do what we do,20685401,672
6,Julia Sweeney,"Actor, comedian, playwright",Letting go of God,3769987,919
7,Joshua Prince-Ramus,Architect,Behind the design of Seattle's library,967741,46
8,Dan Dennett,"Philosopher, cognitive scientist",Let's teach religion -- all religion -- in sch...,2567958,582
9,Rick Warren,"Pastor, author",A life of purpose,3095993,900

In [54]:
df=pd.read_excel('datasets/football_worldcup.xlsx')

In [55]:
df

   Year       Country    Winner   Runners-Up  GoalsScored  MatchesPlayed
0  1990         Italy  Germany     Argentina          115             52
1  1994           USA    Brazil        Italy          141             52
2  1998        France    France       Brazil          171             64
3  2002         Japan    Brazil      Germany          161             64
4  2006       Germany     Italy       France          147             64
5  2010  South Africa     Spain  Netherlands          145             64
6  2014        Brazil   Germany    Argentina          171             64

### 2.Creating a DataFrame using Dictionaries

In [8]:
df_dict={'Year':[1990,1994,1998,2002],                    
          'Country':['Italy','USA','France','Japan'],
          'Winner':['Germany','Brazil','France','Brazil'],
          'GoalScored':[115,141,171,161]}

In [11]:
df=pd.DataFrame(df_dict)  #all the arrays should have same length

In [10]:
df    #returns the keys as column name and values corresponding to keys as the column values.

   Year Country   Winner  GoalScored
0  1990   Italy  Germany         115
1  1994     USA   Brazil         141
2  1998  France   France         171
3  2002   Japan   Brazil         161

### 3.Creating a DataFrame using dictionary using Series value

In [15]:
df_dict={'Year':pd.Series([1990,1994,1998,2002]),
          'Country':pd.Series(['Italy','USA','France','Japan']),
          'Winner':pd.Series(['Germany','Brazil','France','Brazil']),
          'GoalScored':pd.Series([115,141,171,161])}

In [16]:
df=pd.DataFrame(df_dict)    #all the arrays need not be of same length.For whichever the data is not present, it will put NaN.

In [17]:
df   #The keys are column names and the series returns corresponding column values

   Year Country   Winner  GoalScored
0  1990   Italy  Germany         115
1  1994     USA   Brazil         141
2  1998  France   France         171
3  2002   Japan   Brazil         161

In [18]:
#NaN-Not a Number-represents a null field

In [19]:
df_dict={'Year':pd.Series([1990,1994,1998,2002]),
          'Country':pd.Series(['Italy','USA','France','Japan']),
          'Winner':pd.Series(['Germany','Brazil','France','Brazil']),
          'GoalScored':pd.Series([115,141,171])}

In [20]:
df=pd.DataFrame(df_dict)

In [21]:
df

   Year Country   Winner  GoalScored
0  1990   Italy  Germany       115.0
1  1994     USA   Brazil       141.0
2  1998  France   France       171.0
3  2002   Japan   Brazil         NaN

### 4.Creating a data frame using list of tuples

In [63]:
df_tuples=[(2002,'Japan','Brazil',161),
           (2006,'Germany','Italy',147),
           (2010,'South Africa','Spain',145),
           (2014,'Brazil','Germany',171)]

In [64]:
df=pd.DataFrame(df_tuples)

In [65]:
df   #Each tuple is returned as a row

      0             1        2    3
0  2002         Japan   Brazil  161
1  2006       Germany    Italy  147
2  2010  South Africa    Spain  145
3  2014        Brazil  Germany  171

In [66]:
df=pd.DataFrame(df_tuples,columns=['Year','Host Country','Winner','Goals Scored'])

In [22]:
df   #The column name is named using the keyword=column

   Year Country   Winner  GoalScored
0  1990   Italy  Germany       115.0
1  1994     USA   Brazil       141.0
2  1998  France   France       171.0
3  2002   Japan   Brazil         NaN

### 5.creating a DataFrame using a list of dictionaries

In [68]:
df_dict=[
        {'Year':2002,'Host Country':'Japan','Winner':'Brazil','Goals Scored':161},
        {'Year':2006,'Host Country':'Germany','Winner':'Italy','Goals Scored':147},
        {'Year':2010,'Host Country':'South Africa','Winner':'Spain','Goals Scored':145},
        {'Year':2014,'Host Country':'Brazil','Winner':'Germany','Goals Scored':171},
        ]

In [69]:
df=pd.DataFrame(df_dict)

In [23]:
df  #returns as a row under respective key as column name

   Year Country   Winner  GoalScored
0  1990   Italy  Germany       115.0
1  1994     USA   Brazil       141.0
2  1998  France   France       171.0
3  2002   Japan   Brazil         NaN

## DataFrame Basics

In [32]:
cd datasets/

C:\Users\SRADHA\Desktop\python\datasets\datasets

In [33]:
ls

 Volume in drive C has no label.
 Volume Serial Number is B4D5-CE5A

 Directory of C:\Users\SRADHA\Desktop\python\datasets\datasets

02/22/2022  07:38 PM    <DIR>          .
02/22/2022  07:38 PM    <DIR>          ..
07/16/2018  02:19 PM             6,148 .DS_Store
07/17/2018  01:15 PM             6,182 apple_stocks.csv
07/12/2018  11:46 AM           374,371 appleStore_description.csv
07/19/2018  02:23 PM             6,435 automobile_camera.xlsx
07/16/2018  03:39 PM               799 avocado.csv
07/16/2018  12:43 PM         1,989,197 avocado_full.csv
07/11/2018  04:07 PM            56,278 Camera.csv
07/11/2018  01:03 PM               713 cars_data.csv
07/16/2018  11:15 AM         3,880,396 citibike_tripdata.csv
07/11/2018  10:46 PM               704 Crime in the United States.csv
07/16/2018  02:58 PM            70,030 data.csv
07/16/2018  05:18 PM            24,552 electricity.csv
07/16/2018  11:01 PM             1,423 electricity_kWh.csv
07/15/2018  10:33 PM             9,707 FIFA 2018 Statistics.csv
07/09/2018  03:16 PM             6,352 football_worldcup.xlsx
07/09/2018  10:32 PM               401 imdb_rating.csv
07/10/2018  05:46 PM               114 international_org.csv
03/21/2019  12:54 PM            47,630 london_weather.csv
07/19/2018  02:21 PM               196 new_automobile.csv
07/19/2018  02:22 PM             5,634 new_automobile.xlsx
07/19/2018  02:21 PM               185 new_automobile_wi.csv
07/19/2018  02:22 PM               139 new_automobile_wi_1.csv
07/12/2018  04:51 PM               533 ny_weather.csv
07/09/2018  05:00 PM               616 nyc_weather.csv
07/12/2018  02:34 PM             5,646 spacex_launch_data.csv
07/19/2018  01:55 PM             6,129 stock_data.xlsx
07/09/2018  02:41 PM               849 ted_data.csv
02/22/2022  07:38 PM            61,194 titanic.csv
07/12/2018  11:53 AM               401 unsorted_imdb_rating.csv
07/11/2018  01:49 PM               344 us_temp.csv
07/15/2018  09:49 PM        10,074,957 visa.csv
04/04/2021  10:49 AM           105,143 weather_by_cities.csv
04/04/2021  10:53 AM               367 weather_by_cities_group_by.csv
07/09/2018  11:16 AM               153 weather_data.csv
04/04/2021  10:53 AM               191 weather_data_nan.csv
04/04/2021  10:53 AM               179 weather_data_replace.csv
07/16/2018  02:47 PM             9,114 world_happiness.csv
              37 File(s)     16,753,402 bytes
               2 Dir(s)  182,240,215,040 bytes free

In [34]:
weather_data=pd.read_csv('weather_data.csv')

In [35]:
weather_data

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

In [36]:
#How many rows and columns are present
weather_data.shape

(6, 4)

In [76]:
#Display top n datas
weather_data.head(2)  #displays only the top 2 datas

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny

In [77]:
weather_data.head()  #default value is 5

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain

In [78]:
#Display botton n datas
weather_data.tail(2)

        day  temperature  windspeed  event
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

In [79]:
weather_data.tail()     #default value is 5

        day  temperature  windspeed  event
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

In [80]:
#list of all columns
weather_data.columns

Index(['day', 'temperature', 'windspeed', 'event'], dtype='object')

In [37]:
#info-information
weather_data.info()  #Gives the total no of rows,total no of columns, and data type of each column

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 4 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   day          6 non-null      object
 1   temperature  6 non-null      int64
 2   windspeed    6 non-null      int64
 3   event        6 non-null      object
dtypes: int64(2), object(2)
memory usage: 320.0+ bytes

In [82]:
#statistical information-Gives the basic statistical values. Can't be found for string datatype
weather_data.describe()

       temperature  windspeed
count     6.000000   6.000000
mean     30.333333   4.666667
std       3.829708   2.338090
min      24.000000   2.000000
25%      28.750000   2.500000
50%      31.500000   5.000000
75%      32.000000   6.750000
max      35.000000   7.000000

In [83]:
weather_data.describe(include='object')  #Includes basic statistical values for object data type also

             day event
count          6     6
unique         6     3
top     1/1/2017  Rain
freq           1     2

In [84]:
weather_data.describe(include='all')  #Includes all data types,numerical as well as categorical

             day  temperature  windspeed event
count          6     6.000000   6.000000     6
unique         6          NaN        NaN     3
top     1/1/2017          NaN        NaN  Rain
freq           1          NaN        NaN     2
mean         NaN    30.333333   4.666667   NaN
std          NaN     3.829708   2.338090   NaN
min          NaN    24.000000   2.000000   NaN
25%          NaN    28.750000   2.500000   NaN
50%          NaN    31.500000   5.000000   NaN
75%          NaN    32.000000   6.750000   NaN
max          NaN    35.000000   7.000000   NaN

In [85]:
cd ..

C:\Users\SRADHA\Desktop\python\datasets

In [86]:
weather_data=pd.read_csv('datasets/weather_data.csv', header=None)   #csv=comma separated values
weather_data

          0            1          2      3
0       day  temperature  windspeed  event
1  1/1/2017           32          6   Rain
2  1/2/2017           35          7  Sunny
3  1/3/2017           28          2   Snow
4  1/4/2017           24          7   Snow
5  1/5/2017           32          4   Rain
6  1/6/2017           31          2  Sunny

## Indexing and Slicing

In [40]:
ls

 Volume in drive C has no label.
 Volume Serial Number is B4D5-CE5A

 Directory of C:\Users\SRADHA\Desktop\python\datasets\datasets

02/22/2022  07:38 PM    <DIR>          .
02/22/2022  07:38 PM    <DIR>          ..
07/16/2018  02:19 PM             6,148 .DS_Store
07/17/2018  01:15 PM             6,182 apple_stocks.csv
07/12/2018  11:46 AM           374,371 appleStore_description.csv
07/19/2018  02:23 PM             6,435 automobile_camera.xlsx
07/16/2018  03:39 PM               799 avocado.csv
07/16/2018  12:43 PM         1,989,197 avocado_full.csv
07/11/2018  04:07 PM            56,278 Camera.csv
07/11/2018  01:03 PM               713 cars_data.csv
07/16/2018  11:15 AM         3,880,396 citibike_tripdata.csv
07/11/2018  10:46 PM               704 Crime in the United States.csv
07/16/2018  02:58 PM            70,030 data.csv
07/16/2018  05:18 PM            24,552 electricity.csv
07/16/2018  11:01 PM             1,423 electricity_kWh.csv
07/15/2018  10:33 PM             9,707 FIFA 2018 Statistics.csv
07/09/2018  03:16 PM             6,352 football_worldcup.xlsx
07/09/2018  10:32 PM               401 imdb_rating.csv
07/10/2018  05:46 PM               114 international_org.csv
03/21/2019  12:54 PM            47,630 london_weather.csv
07/19/2018  02:21 PM               196 new_automobile.csv
07/19/2018  02:22 PM             5,634 new_automobile.xlsx
07/19/2018  02:21 PM               185 new_automobile_wi.csv
07/19/2018  02:22 PM               139 new_automobile_wi_1.csv
07/12/2018  04:51 PM               533 ny_weather.csv
07/09/2018  05:00 PM               616 nyc_weather.csv
07/12/2018  02:34 PM             5,646 spacex_launch_data.csv
07/19/2018  01:55 PM             6,129 stock_data.xlsx
07/09/2018  02:41 PM               849 ted_data.csv
02/22/2022  07:38 PM            61,194 titanic.csv
07/12/2018  11:53 AM               401 unsorted_imdb_rating.csv
07/11/2018  01:49 PM               344 us_temp.csv
07/15/2018  09:49 PM        10,074,957 visa.csv
04/04/2021  10:49 AM           105,143 weather_by_cities.csv
04/04/2021  10:53 AM               367 weather_by_cities_group_by.csv
07/09/2018  11:16 AM               153 weather_data.csv
04/04/2021  10:53 AM               191 weather_data_nan.csv
04/04/2021  10:53 AM               179 weather_data_replace.csv
07/16/2018  02:47 PM             9,114 world_happiness.csv
              37 File(s)     16,753,402 bytes
               2 Dir(s)  182,239,277,056 bytes free

In [41]:
bike_share=pd.read_csv('citibike_tripdata.csv')

In [42]:
bike_share

,tripduration,starttime,stoptime,start station id,start station name,end station id,end station name,bikeid,name_localizedValue,usertype
0,338,2018-05-01 00:04:47,2018-05-01 00:10:25,3639,Harborside,3199,Newport Pkwy,33558,Annual Membership,Subscriber
1,1482,2018-05-01 01:31:10,2018-05-01 01:55:53,3681,Grand St,3185,City Hall,33593,24 Hour,Customer
2,232,2018-05-01 01:31:29,2018-05-01 01:35:22,3194,McGinley Square,3193,Lincoln Park,29217,FREE Bonus Month with Annual Membership,Subscriber
3,190,2018-05-01 02:03:29,2018-05-01 02:06:40,3185,City Hall,3186,Grove St PATH,29662,24 Hour,Customer
4,303,2018-05-01 04:27:12,2018-05-01 04:32:16,3207,Oakland Ave,3195,Sip Ave,15271,Annual Membership,Subscriber
...,...,...,...,...,...,...,...,...,...,...
32423,396,2018-05-30 13:49:18,2018-05-30 13:55:55,3184,Paulus Hook,3279,Dixon Mills,29639,Join Citi Bike for $14.95/month,Subscriber
32424,313,2018-05-30 13:49:21,2018-05-30 13:54:35,3202,Newport PATH,3639,Harborside,26301,$25 Off Annual Membership,Subscriber
32425,316,2018-05-30 13:49:51,2018-05-30 13:55:08,3220,5 Corners Library,3195,Sip Ave,29260,Annual Membership,Subscriber
32426,1130,2018-05-30 13:50:52,2018-05-30 14:09:42,3281,Leonard Gordon Park,3213,Van Vorst Park,26239,Annual Membership,Subscriber
32427,369,2018-05-30 13:50:58,2018-05-30 13:57:08,3220,5 Corners Library,3207,Oakland Ave,33660,Annual Membership,Subscriber

In [89]:
bike_share.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32428 entries, 0 to 32427
Data columns (total 10 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   tripduration         32428 non-null  int64
 1   starttime            32428 non-null  object
 2   stoptime             32428 non-null  object
 3   start station id     32428 non-null  int64
 4   start station name   32428 non-null  object
 5   end station id       32428 non-null  int64
 6   end station name     32428 non-null  object
 7   bikeid               32428 non-null  int64
 8   name_localizedValue  32428 non-null  object
 9   usertype             32428 non-null  object
dtypes: int64(4), object(6)
memory usage: 2.5+ MB

In [90]:
#Indexing-can be done in 2 ways i.e column-wise/row_wise

In [91]:
bike_share['bikeid']

0        33558
1        33593
2        29217
3        29662
4        15271
         ...
32423    29639
32424    26301
32425    29260
32426    26239
32427    33660
Name: bikeid, Length: 32428, dtype: int64

In [92]:
bike_share.bikeid

0        33558
1        33593
2        29217
3        29662
4        15271
         ...
32423    29639
32424    26301
32425    29260
32426    26239
32427    33660
Name: bikeid, Length: 32428, dtype: int64

In [93]:
#accessing multiple columns

In [94]:
bike_share[['bikeid','usertype']]

       bikeid    usertype
0       33558  Subscriber
1       33593    Customer
2       29217  Subscriber
3       29662    Customer
4       15271  Subscriber
...       ...         ...
32423   29639  Subscriber
32424   26301  Subscriber
32425   29260  Subscriber
32426   26239  Subscriber
32427   33660  Subscriber

[32428 rows x 2 columns]

In [95]:
bike_share[['bikeid','usertype']].head()

   bikeid    usertype
0   33558  Subscriber
1   33593    Customer
2   29217  Subscriber
3   29662    Customer
4   15271  Subscriber

In [96]:
bike_share[['bikeid','usertype']].tail()

       bikeid    usertype
32423   29639  Subscriber
32424   26301  Subscriber
32425   29260  Subscriber
32426   26239  Subscriber
32427   33660  Subscriber

In [97]:
bike_share.at[1,'bikeid']  #row=index 1 and column='bikeid'

33593

In [98]:
#But by indexing we can't extract the rows

In [99]:
#Slicing operation-Always gives the new dataframe
'''3 different ways:
    1.Normal way
    2.loc way
    3.iloc way'''

'3 different ways:\n    1.Normal way\n    2.loc way\n    3.iloc way'

### 1.Normal way-it does the slicing only on the rows
- syntax=df[start,stop,step]  (zero indexing)
or
- syntax=df[row_name_start,row_name_stop,step]  (custom indexing)

In [43]:
bike_share[0:3]

,tripduration,starttime,stoptime,start station id,start station name,end station id,end station name,bikeid,name_localizedValue,usertype
0,338,2018-05-01 00:04:47,2018-05-01 00:10:25,3639,Harborside,3199,Newport Pkwy,33558,Annual Membership,Subscriber
1,1482,2018-05-01 01:31:10,2018-05-01 01:55:53,3681,Grand St,3185,City Hall,33593,24 Hour,Customer
2,232,2018-05-01 01:31:29,2018-05-01 01:35:22,3194,McGinley Square,3193,Lincoln Park,29217,FREE Bonus Month with Annual Membership,Subscriber

In [100]:
new_df=bike_share[0:6]

In [101]:
new_df

,tripduration,starttime,stoptime,start station id,start station name,end station id,end station name,bikeid,name_localizedValue,usertype
0,338,2018-05-01 00:04:47,2018-05-01 00:10:25,3639,Harborside,3199,Newport Pkwy,33558,Annual Membership,Subscriber
1,1482,2018-05-01 01:31:10,2018-05-01 01:55:53,3681,Grand St,3185,City Hall,33593,24 Hour,Customer
2,232,2018-05-01 01:31:29,2018-05-01 01:35:22,3194,McGinley Square,3193,Lincoln Park,29217,FREE Bonus Month with Annual Membership,Subscriber
3,190,2018-05-01 02:03:29,2018-05-01 02:06:40,3185,City Hall,3186,Grove St PATH,29662,24 Hour,Customer
4,303,2018-05-01 04:27:12,2018-05-01 04:32:16,3207,Oakland Ave,3195,Sip Ave,15271,Annual Membership,Subscriber
5,176,2018-05-01 04:37:05,2018-05-01 04:40:01,3194,McGinley Square,3195,Sip Ave,29298,Annual Membership,Subscriber

In [102]:
index_value=['row_1','row_2','row_3','row_4','row_5','row_6']

In [103]:
new_df.index=index_value

In [104]:
new_df

,tripduration,starttime,stoptime,start station id,start station name,end station id,end station name,bikeid,name_localizedValue,usertype
row_1,338,2018-05-01 00:04:47,2018-05-01 00:10:25,3639,Harborside,3199,Newport Pkwy,33558,Annual Membership,Subscriber
row_2,1482,2018-05-01 01:31:10,2018-05-01 01:55:53,3681,Grand St,3185,City Hall,33593,24 Hour,Customer
row_3,232,2018-05-01 01:31:29,2018-05-01 01:35:22,3194,McGinley Square,3193,Lincoln Park,29217,FREE Bonus Month with Annual Membership,Subscriber
row_4,190,2018-05-01 02:03:29,2018-05-01 02:06:40,3185,City Hall,3186,Grove St PATH,29662,24 Hour,Customer
row_5,303,2018-05-01 04:27:12,2018-05-01 04:32:16,3207,Oakland Ave,3195,Sip Ave,15271,Annual Membership,Subscriber
row_6,176,2018-05-01 04:37:05,2018-05-01 04:40:01,3194,McGinley Square,3195,Sip Ave,29298,Annual Membership,Subscriber

In [105]:
new_df[0:3]

,tripduration,starttime,stoptime,start station id,start station name,end station id,end station name,bikeid,name_localizedValue,usertype
row_1,338,2018-05-01 00:04:47,2018-05-01 00:10:25,3639,Harborside,3199,Newport Pkwy,33558,Annual Membership,Subscriber
row_2,1482,2018-05-01 01:31:10,2018-05-01 01:55:53,3681,Grand St,3185,City Hall,33593,24 Hour,Customer
row_3,232,2018-05-01 01:31:29,2018-05-01 01:35:22,3194,McGinley Square,3193,Lincoln Park,29217,FREE Bonus Month with Annual Membership,Subscriber

In [106]:
new_df['row_1':'row_3']

,tripduration,starttime,stoptime,start station id,start station name,end station id,end station name,bikeid,name_localizedValue,usertype
row_1,338,2018-05-01 00:04:47,2018-05-01 00:10:25,3639,Harborside,3199,Newport Pkwy,33558,Annual Membership,Subscriber
row_2,1482,2018-05-01 01:31:10,2018-05-01 01:55:53,3681,Grand St,3185,City Hall,33593,24 Hour,Customer
row_3,232,2018-05-01 01:31:29,2018-05-01 01:35:22,3194,McGinley Square,3193,Lincoln Park,29217,FREE Bonus Month with Annual Membership,Subscriber

### 2. loc method-location
- Does the slicing based on the rows as well as the columns
- syntax: df_loc[row_name_start:row-name_stop:step,column_name_start:column_name_stop:step]

- can do slicing based on what you see. zero slicing doesn't work if there is no indexing from 0
- can do filtering

In [107]:
new_df.loc['row_1':'row_3','tripduration':'start station name':2]

       tripduration             stoptime start station name
row_1           338  2018-05-01 00:10:25         Harborside
row_2          1482  2018-05-01 01:55:53           Grand St
row_3           232  2018-05-01 01:35:22    McGinley Square

In [108]:
new_df.loc[::2,::-1]

,usertype,name_localizedValue,bikeid,end station name,end station id,start station name,start station id,stoptime,starttime,tripduration
row_1,Subscriber,Annual Membership,33558,Newport Pkwy,3199,Harborside,3639,2018-05-01 00:10:25,2018-05-01 00:04:47,338
row_3,Subscriber,FREE Bonus Month with Annual Membership,29217,Lincoln Park,3193,McGinley Square,3194,2018-05-01 01:35:22,2018-05-01 01:31:29,232
row_5,Subscriber,Annual Membership,15271,Sip Ave,3195,Oakland Ave,3207,2018-05-01 04:32:16,2018-05-01 04:27:12,303

In [109]:
new_df.loc[['row_1','row_2','row_5','row_6'],['tripduration','starttime','usertype']]

       tripduration            starttime    usertype
row_1           338  2018-05-01 00:04:47  Subscriber
row_2          1482  2018-05-01 01:31:10    Customer
row_5           303  2018-05-01 04:27:12  Subscriber
row_6           176  2018-05-01 04:37:05  Subscriber

In [110]:
#slicing based on some conditions
#only those data where tripduration is more than 300

new_df.loc[new_df['tripduration']>300]

,tripduration,starttime,stoptime,start station id,start station name,end station id,end station name,bikeid,name_localizedValue,usertype
row_1,338,2018-05-01 00:04:47,2018-05-01 00:10:25,3639,Harborside,3199,Newport Pkwy,33558,Annual Membership,Subscriber
row_2,1482,2018-05-01 01:31:10,2018-05-01 01:55:53,3681,Grand St,3185,City Hall,33593,24 Hour,Customer
row_5,303,2018-05-01 04:27:12,2018-05-01 04:32:16,3207,Oakland Ave,3195,Sip Ave,15271,Annual Membership,Subscriber

In [111]:
new_df.loc[new_df['usertype']=='Customer']

,tripduration,starttime,stoptime,start station id,start station name,end station id,end station name,bikeid,name_localizedValue,usertype
row_2,1482,2018-05-01 01:31:10,2018-05-01 01:55:53,3681,Grand St,3185,City Hall,33593,24 Hour,Customer
row_4,190,2018-05-01 02:03:29,2018-05-01 02:06:40,3185,City Hall,3186,Grove St PATH,29662,24 Hour,Customer

In [112]:
new_df.loc[(new_df['usertype']=='Subscriber') & (new_df['bikeid']<30000)]

,tripduration,starttime,stoptime,start station id,start station name,end station id,end station name,bikeid,name_localizedValue,usertype
row_3,232,2018-05-01 01:31:29,2018-05-01 01:35:22,3194,McGinley Square,3193,Lincoln Park,29217,FREE Bonus Month with Annual Membership,Subscriber
row_5,303,2018-05-01 04:27:12,2018-05-01 04:32:16,3207,Oakland Ave,3195,Sip Ave,15271,Annual Membership,Subscriber
row_6,176,2018-05-01 04:37:05,2018-05-01 04:40:01,3194,McGinley Square,3195,Sip Ave,29298,Annual Membership,Subscriber

### 3.iloc way
- We can also do the slicing based on rows and columns.
- The slicing is done only based on the indexes.
- syntax: df[start:stop:step]
- By default-zero indexing

In [113]:
new_df.iloc[0:3,0:3]

       tripduration            starttime             stoptime
row_1           338  2018-05-01 00:04:47  2018-05-01 00:10:25
row_2          1482  2018-05-01 01:31:10  2018-05-01 01:55:53
row_3           232  2018-05-01 01:31:29  2018-05-01 01:35:22

In [114]:
new_df.iloc[[0,2,3],0:3]

       tripduration            starttime             stoptime
row_1           338  2018-05-01 00:04:47  2018-05-01 00:10:25
row_3           232  2018-05-01 01:31:29  2018-05-01 01:35:22
row_4           190  2018-05-01 02:03:29  2018-05-01 02:06:40

## Addition and deletion in dataframe

In [115]:
df=pd.read_csv('datasets/international_org.csv')

In [116]:
df

  Organization Name  Headquater
0               FAO        Rome
1               ICJ   The Hague
2               IMF  Washington
3            UNESCO       Paris
4               UNO    New York
5        World Bank  Washington

In [117]:
#add a new column
df['Headquater']

0          Rome
1     The Hague
2    Washington
3         Paris
4      New York
5    Washington
Name: Headquater, dtype: object

In [118]:
df['Established Year']=1957   #if the same column name will be given, data will be overwritten

In [119]:
df

  Organization Name  Headquater  Established Year
0               FAO        Rome              1957
1               ICJ   The Hague              1957
2               IMF  Washington              1957
3            UNESCO       Paris              1957
4               UNO    New York              1957
5        World Bank  Washington              1957

In [120]:
df['Established Year']=[2002,2004,2004,1997,1998,1999]

In [121]:
df

  Organization Name  Headquater  Established Year
0               FAO        Rome              2002
1               ICJ   The Hague              2004
2               IMF  Washington              2004
3            UNESCO       Paris              1997
4               UNO    New York              1998
5        World Bank  Washington              1999

In [122]:
df.insert(2,'Established year',1947)  #inserts at index=2

In [123]:
df

  Organization Name  Headquater  Established year  Established Year
0               FAO        Rome              1947              2002
1               ICJ   The Hague              1947              2004
2               IMF  Washington              1947              2004
3            UNESCO       Paris              1947              1997
4               UNO    New York              1947              1998
5        World Bank  Washington              1947              1999

In [124]:
#rename a column
df.rename(columns={'Established year':'abc'})

  Organization Name  Headquater   abc  Established Year
0               FAO        Rome  1947              2002
1               ICJ   The Hague  1947              2004
2               IMF  Washington  1947              2004
3            UNESCO       Paris  1947              1997
4               UNO    New York  1947              1998
5        World Bank  Washington  1947              1999

In [125]:
df=pd.read_csv('datasets/international_org.csv')

In [126]:
df

  Organization Name  Headquater
0               FAO        Rome
1               ICJ   The Hague
2               IMF  Washington
3            UNESCO       Paris
4               UNO    New York
5        World Bank  Washington

In [127]:
df.at[0,'Headquater']   #returns value at index=0 and column='Headquater'

'Rome'

In [128]:
df.at[0,'Headquater']='India'  #replaces the value 'Indeia' at index=0 and column='Headquater'

In [129]:
df

  Organization Name  Headquater
0               FAO       India
1               ICJ   The Hague
2               IMF  Washington
3            UNESCO       Paris
4               UNO    New York
5        World Bank  Washington

In [130]:
df.loc[6]=['RBI','India']   #inserts a row at index=6

In [131]:
df

  Organization Name  Headquater
0               FAO       India
1               ICJ   The Hague
2               IMF  Washington
3            UNESCO       Paris
4               UNO    New York
5        World Bank  Washington
6               RBI       India

In [132]:
#delete the columns and rows
#drop

In [133]:
df.drop(axis=1,columns='Headquater')  #new dataframe #to save in the current df,assign to new df or inplace=True

  Organization Name
0               FAO
1               ICJ
2               IMF
3            UNESCO
4               UNO
5        World Bank
6               RBI

In [134]:
df

  Organization Name  Headquater
0               FAO       India
1               ICJ   The Hague
2               IMF  Washington
3            UNESCO       Paris
4               UNO    New York
5        World Bank  Washington
6               RBI       India

In [135]:
df.drop(axis=1,columns='Headquater',inplace=True)

In [136]:
df

  Organization Name
0               FAO
1               ICJ
2               IMF
3            UNESCO
4               UNO
5        World Bank
6               RBI

In [137]:
df.drop(axis=0,index=[0,1,2])  #mention the axis before deleting

  Organization Name
3            UNESCO
4               UNO
5        World Bank
6               RBI

In [138]:
#adding a column
#adding a column at a particular location
#updating a particular value
#adding a new row
#adding or updating existing rows
#deletion row/column

In [139]:
#iterating over a dataframe
# 1.itertuple
# 2.iterrows
# 3.iteritems

In [140]:
space_org={'Organizations_name':['CNES','ISRO','NASA','JAXA','CNSA'],
               'Headquarters':['Paris','Bangalore','Washington','Tokyo','Beijing'],
              'Country_Name':['France','India','USA','Japan','China'],
             'Formation_Year':[1961,1969,1958,2003,1993]}

In [141]:
df=pd.DataFrame(space_org)

In [142]:
df

  Organizations_name Headquarters Country_Name  Formation_Year
0               CNES        Paris       France            1961
1               ISRO    Bangalore        India            1969
2               NASA   Washington          USA            1958
3               JAXA        Tokyo        Japan            2003
4               CNSA      Beijing        China            1993

In [144]:
#1.itertuples
'''
-It will iterate over each rows and return type is pandas data type.
'''

for i in df.itertuples():
    print(i)

Pandas(Index=0, Organizations_name='CNES', Headquarters='Paris', Country_Name='France', Formation_Year=1961)
Pandas(Index=1, Organizations_name='ISRO', Headquarters='Bangalore', Country_Name='India', Formation_Year=1969)
Pandas(Index=2, Organizations_name='NASA', Headquarters='Washington', Country_Name='USA', Formation_Year=1958)
Pandas(Index=3, Organizations_name='JAXA', Headquarters='Tokyo', Country_Name='Japan', Formation_Year=2003)
Pandas(Index=4, Organizations_name='CNSA', Headquarters='Beijing', Country_Name='China', Formation_Year=1993)

In [146]:
for i in df.itertuples():
    print(i.Organizations_name)

CNES
ISRO
NASA
JAXA
CNSA

In [149]:
#iterrows-returns a tuple-0:index,1:series
'''
-It will iter over each rows.
-return type is tuple where the first value is int and the second value is series.
'''

for i in df.iterrows():
    print(i)
    print(type(i[0]),type(i[1]))

(0, Organizations_name      CNES
Headquarters           Paris
Country_Name          France
Formation_Year          1961
Name: 0, dtype: object)
<class 'int'> <class 'pandas.core.series.Series'>
(1, Organizations_name         ISRO
Headquarters          Bangalore
Country_Name              India
Formation_Year             1969
Name: 1, dtype: object)
<class 'int'> <class 'pandas.core.series.Series'>
(2, Organizations_name          NASA
Headquarters          Washington
Country_Name                 USA
Formation_Year              1958
Name: 2, dtype: object)
<class 'int'> <class 'pandas.core.series.Series'>
(3, Organizations_name     JAXA
Headquarters          Tokyo
Country_Name          Japan
Formation_Year         2003
Name: 3, dtype: object)
<class 'int'> <class 'pandas.core.series.Series'>
(4, Organizations_name       CNSA
Headquarters          Beijing
Country_Name            China
Formation_Year           1993
Name: 4, dtype: object)
<class 'int'> <class 'pandas.core.series.Series'>

In [153]:
#iteritems-returns a tuple,0:string,1:series dataset
'''
-It will iter over each column.
-return type is tuple where the first value is str(column_name) and the second value is series.
'''

for i in df.iteritems():
    print(i)

('Organizations_name', 0    CNES
1    ISRO
2    NASA
3    JAXA
4    CNSA
Name: Organizations_name, dtype: object)
('Headquarters', 0         Paris
1     Bangalore
2    Washington
3         Tokyo
4       Beijing
Name: Headquarters, dtype: object)
('Country_Name', 0    France
1     India
2       USA
3     Japan
4     China
Name: Country_Name, dtype: object)
('Formation_Year', 0    1961
1    1969
2    1958
3    2003
4    1993
Name: Formation_Year, dtype: int64)

In [154]:
#sorting

In [155]:
df=pd.read_csv('datasets/unsorted_imdb_rating.csv')

In [156]:
df

,star_rating,title,genre,duration
0,9.3,The Shawshank Redemption,Crime,142
1,9.1,The Godfather,Crime,175
2,9.2,The Godfather: Part II,Crime,200
3,9.0,The Dark Knight,Action,152
4,8.9,Pulp Fiction,Crime,154
5,8.8,12 Angry Men,Drama,96
6,8.7,"The Good, the Bad and the Ugly",Western,161
7,8.9,The Lord of the Rings: The Return of the King,Adventure,201
8,8.3,Schindler's List,Biography,195
9,8.1,Fight Club,Drama,139

In [158]:
df.sort_values(by='duration')

,star_rating,title,genre,duration
5,8.8,12 Angry Men,Drama,96
9,8.1,Fight Club,Drama,139
0,9.3,The Shawshank Redemption,Crime,142
3,9.0,The Dark Knight,Action,152
4,8.9,Pulp Fiction,Crime,154
6,8.7,"The Good, the Bad and the Ugly",Western,161
1,9.1,The Godfather,Crime,175
8,8.3,Schindler's List,Biography,195
2,9.2,The Godfather: Part II,Crime,200
7,8.9,The Lord of the Rings: The Return of the King,Adventure,201

In [159]:
df.sort_values(by='duration',ascending=False)   #descending

,star_rating,title,genre,duration
7,8.9,The Lord of the Rings: The Return of the King,Adventure,201
2,9.2,The Godfather: Part II,Crime,200
8,8.3,Schindler's List,Biography,195
1,9.1,The Godfather,Crime,175
6,8.7,"The Good, the Bad and the Ugly",Western,161
4,8.9,Pulp Fiction,Crime,154
3,9.0,The Dark Knight,Action,152
0,9.3,The Shawshank Redemption,Crime,142
9,8.1,Fight Club,Drama,139
5,8.8,12 Angry Men,Drama,96

In [160]:
df

,star_rating,title,genre,duration
0,9.3,The Shawshank Redemption,Crime,142
1,9.1,The Godfather,Crime,175
2,9.2,The Godfather: Part II,Crime,200
3,9.0,The Dark Knight,Action,152
4,8.9,Pulp Fiction,Crime,154
5,8.8,12 Angry Men,Drama,96
6,8.7,"The Good, the Bad and the Ugly",Western,161
7,8.9,The Lord of the Rings: The Return of the King,Adventure,201
8,8.3,Schindler's List,Biography,195
9,8.1,Fight Club,Drama,139

In [163]:
df.sort_values(by=['genre','star_rating'])  #first sort by genre and then within that sort by star_rating

,star_rating,title,genre,duration
3,9.0,The Dark Knight,Action,152
7,8.9,The Lord of the Rings: The Return of the King,Adventure,201
8,8.3,Schindler's List,Biography,195
4,8.9,Pulp Fiction,Crime,154
1,9.1,The Godfather,Crime,175
2,9.2,The Godfather: Part II,Crime,200
0,9.3,The Shawshank Redemption,Crime,142
9,8.1,Fight Club,Drama,139
5,8.8,12 Angry Men,Drama,96
6,8.7,"The Good, the Bad and the Ugly",Western,161

In [168]:
#Concatenate two data frames
India_weather=pd.DataFrame({'city':['Mumbai','Delhi','Bangalore'],
                           'temperature':[32,45,30],
                           'humidity':[80,60,78]})
India_weather

        city  temperature  humidity
0     Mumbai           32        80
1      Delhi           45        60
2  Bangalore           30        78

In [169]:
US_weather=pd.DataFrame({'city':['NewYork','Chicago','Orlando'],
                           'temperature':[21,14,35],
                           'humidity':[68,65,75]})
US_weather

      city  temperature  humidity
0  NewYork           21        68
1  Chicago           14        65
2  Orlando           35        75

In [172]:
df=pd.concat([India_weather,US_weather])
df

        city  temperature  humidity
0     Mumbai           32        80
1      Delhi           45        60
2  Bangalore           30        78
0    NewYork           21        68
1    Chicago           14        65
2    Orlando           35        75

In [175]:
#2 options
#1. reset the index

df.reset_index()

   index       city  temperature  humidity
0      0     Mumbai           32        80
1      1      Delhi           45        60
2      2  Bangalore           30        78
3      0    NewYork           21        68
4      1    Chicago           14        65
5      2    Orlando           35        75

In [176]:
df.reset_index(drop=True)   #drops the previous index

        city  temperature  humidity
0     Mumbai           32        80
1      Delhi           45        60
2  Bangalore           30        78
3    NewYork           21        68
4    Chicago           14        65
5    Orlando           35        75

In [177]:
#2.ignore_index
df=pd.concat([India_weather,US_weather],ignore_index=True)
df

        city  temperature  humidity
0     Mumbai           32        80
1      Delhi           45        60
2  Bangalore           30        78
3    NewYork           21        68
4    Chicago           14        65
5    Orlando           35        75

In [178]:
df=pd.concat([India_weather,US_weather],keys=['India','US'])  #Two level indexing
df

              city  temperature  humidity
India 0     Mumbai           32        80
      1      Delhi           45        60
      2  Bangalore           30        78
US    0    NewYork           21        68
      1    Chicago           14        65
      2    Orlando           35        75

In [182]:
df.loc['US'].loc[0]['temperature']

21

In [184]:
df.loc['US']['temperature']

0    21
1    14
2    35
Name: temperature, dtype: int64

In [186]:
df1=pd.concat([India_weather,US_weather],axis=1,keys=['India','US'])
df1

       India                            US
        city temperature humidity     city temperature humidity
0     Mumbai          32       80  NewYork          21       68
1      Delhi          45       60  Chicago          14       65
2  Bangalore          30       78  Orlando          35       75

### merging of two dataframes

In [188]:
'''
-can only be done with two dataframes.
-Join:Inner Join-Only the things common between two tables will be shown
-Full join:Outer Join-Common+all data of left table+all data of right table
-Left Join
-Right Join
To merge, you should have some common column between the two dataframes.
'''

'\n-can only be done with two dataframes.\n-Join:Inner Join-Only the things common between two tables will be shown\n-Full join-Common+all data of left table+all data of right table\n-Left Join-\n'

In [193]:
df1=pd.DataFrame({'city':['New York','Chicago','Orlando','Baltimore'],
                 'Temperature':[21,14,35,38]})
df1

        city  Temperature
0   New York           21
1    Chicago           14
2    Orlando           35
3  Baltimore           38

In [197]:
df2=pd.DataFrame({'city':['Chicago','New York','San Diego'],
                 'Humidity':[65,68,75]})
df2

        city  Humidity
0    Chicago        65
1   New York        68
2  San Diego        75

In [198]:
pd.merge(df1,df2)    #bydefault-inner join

       city  Temperature  Humidity
0  New York           21        68
1   Chicago           14        65

In [199]:
pd.merge(df1,df2,on='city',how='inner')

       city  Temperature  Humidity
0  New York           21        68
1   Chicago           14        65

In [200]:
pd.merge(df1,df2,on='city',how='outer')

        city  Temperature  Humidity
0   New York         21.0      68.0
1    Chicago         14.0      65.0
2    Orlando         35.0       NaN
3  Baltimore         38.0       NaN
4  San Diego          NaN      75.0

In [201]:
pd.merge(df1,df2,on='city',how='left')

        city  Temperature  Humidity
0   New York           21      68.0
1    Chicago           14      65.0
2    Orlando           35       NaN
3  Baltimore           38       NaN

In [202]:
pd.merge(df1,df2,on='city',how='right')

        city  Temperature  Humidity
0    Chicago         14.0        65
1   New York         21.0        68
2  San Diego          NaN        75

In [203]:
pd.merge(df1,df2,on='city',how='right',indicator=True)   #indicates from which table

        city  Temperature  Humidity      _merge
0    Chicago         14.0        65        both
1   New York         21.0        68        both
2  San Diego          NaN        75  right_only

## Handling of missing datas

In [204]:
#fillna

In [205]:
df=pd.read_csv('datasets/weather_data_nan.csv')

In [206]:
df

         day  temperature  windspeed   event
0   1/1/2017         32.0        6.0    Rain
1   1/4/2017          NaN        9.0   Sunny
2   1/5/2017         28.0        NaN    Snow
3   1/6/2017          NaN        7.0     NaN
4   1/7/2017         32.0        NaN    Rain
5   1/8/2017          NaN        NaN   Sunny
6   1/9/2017          NaN        NaN     NaN
7  1/10/2017         34.0        8.0  Cloudy
8  1/11/2017         40.0       12.0   Sunny

In [208]:
#fillna
df.fillna(0)

         day  temperature  windspeed   event
0   1/1/2017         32.0        6.0    Rain
1   1/4/2017          0.0        9.0   Sunny
2   1/5/2017         28.0        0.0    Snow
3   1/6/2017          0.0        7.0       0
4   1/7/2017         32.0        0.0    Rain
5   1/8/2017          0.0        0.0   Sunny
6   1/9/2017          0.0        0.0       0
7  1/10/2017         34.0        8.0  Cloudy
8  1/11/2017         40.0       12.0   Sunny

In [209]:
#temperature:100,windspeed:200,event:no event
df.fillna({
    'temperature':100,
    'windspeed':200,
    'event':'no event'
}
)

         day  temperature  windspeed     event
0   1/1/2017         32.0        6.0      Rain
1   1/4/2017        100.0        9.0     Sunny
2   1/5/2017         28.0      200.0      Snow
3   1/6/2017        100.0        7.0  no event
4   1/7/2017         32.0      200.0      Rain
5   1/8/2017        100.0      200.0     Sunny
6   1/9/2017        100.0      200.0  no event
7  1/10/2017         34.0        8.0    Cloudy
8  1/11/2017         40.0       12.0     Sunny

In [213]:
#temperature:mean of temp,windspeed:median of windspeed,event:mode of event
df.fillna({
    'temperature':df['temperature'].mean(),
    'windspeed':df['windspeed'].median(),
    'event':df['event'].mode()[0]
}
)

         day  temperature  windspeed   event
0   1/1/2017         32.0        6.0    Rain
1   1/4/2017         33.2        9.0   Sunny
2   1/5/2017         28.0        8.0    Snow
3   1/6/2017         33.2        7.0   Sunny
4   1/7/2017         32.0        8.0    Rain
5   1/8/2017         33.2        8.0   Sunny
6   1/9/2017         33.2        8.0   Sunny
7  1/10/2017         34.0        8.0  Cloudy
8  1/11/2017         40.0       12.0   Sunny

In [214]:
df

         day  temperature  windspeed   event
0   1/1/2017         32.0        6.0    Rain
1   1/4/2017          NaN        9.0   Sunny
2   1/5/2017         28.0        NaN    Snow
3   1/6/2017          NaN        7.0     NaN
4   1/7/2017         32.0        NaN    Rain
5   1/8/2017          NaN        NaN   Sunny
6   1/9/2017          NaN        NaN     NaN
7  1/10/2017         34.0        8.0  Cloudy
8  1/11/2017         40.0       12.0   Sunny

In [216]:
df.fillna(method='ffill')   #NaN tries to replicate the previous data

         day  temperature  windspeed   event
0   1/1/2017         32.0        6.0    Rain
1   1/4/2017         32.0        9.0   Sunny
2   1/5/2017         28.0        9.0    Snow
3   1/6/2017         28.0        7.0    Snow
4   1/7/2017         32.0        7.0    Rain
5   1/8/2017         32.0        7.0   Sunny
6   1/9/2017         32.0        7.0   Sunny
7  1/10/2017         34.0        8.0  Cloudy
8  1/11/2017         40.0       12.0   Sunny

In [217]:
df.fillna(method='bfill')  #NaN tries to replicate the below data

         day  temperature  windspeed   event
0   1/1/2017         32.0        6.0    Rain
1   1/4/2017         28.0        9.0   Sunny
2   1/5/2017         28.0        7.0    Snow
3   1/6/2017         32.0        7.0    Rain
4   1/7/2017         32.0        8.0    Rain
5   1/8/2017         34.0        8.0   Sunny
6   1/9/2017         34.0        8.0  Cloudy
7  1/10/2017         34.0        8.0  Cloudy
8  1/11/2017         40.0       12.0   Sunny

In [219]:
#dropna-drops the NaN values
df.dropna()  #bydefault axis=0

         day  temperature  windspeed   event
0   1/1/2017         32.0        6.0    Rain
7  1/10/2017         34.0        8.0  Cloudy
8  1/11/2017         40.0       12.0   Sunny

In [220]:
df.dropna(axis=1)

         day
0   1/1/2017
1   1/4/2017
2   1/5/2017
3   1/6/2017
4   1/7/2017
5   1/8/2017
6   1/9/2017
7  1/10/2017
8  1/11/2017

In [222]:
#replace na
df=pd.read_csv('datasets/weather_data_replace.csv')
df

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017       -99999          7  Sunny
2  1/3/2017           28     -99999   Snow
3  1/4/2017       -99999          7      0
4  1/5/2017           32     -99999   Rain
5  1/6/2017           31          2  Sunny
6  1/6/2017           34          5      0

In [223]:
df.replace(-99999,value=np.nan)

        day  temperature  windspeed  event
0  1/1/2017         32.0        6.0   Rain
1  1/2/2017          NaN        7.0  Sunny
2  1/3/2017         28.0        NaN   Snow
3  1/4/2017          NaN        7.0      0
4  1/5/2017         32.0        NaN   Rain
5  1/6/2017         31.0        2.0  Sunny
6  1/6/2017         34.0        5.0      0

In [224]:
df.replace([-99999,0,31],value=np.nan)

        day  temperature  windspeed  event
0  1/1/2017         32.0        6.0   Rain
1  1/2/2017          NaN        7.0  Sunny
2  1/3/2017         28.0        NaN   Snow
3  1/4/2017          NaN        7.0      0
4  1/5/2017         32.0        NaN   Rain
5  1/6/2017          NaN        2.0  Sunny
6  1/6/2017         34.0        5.0      0

In [226]:
type(np.nan)

float

In [227]:
df

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017       -99999          7  Sunny
2  1/3/2017           28     -99999   Snow
3  1/4/2017       -99999          7      0
4  1/5/2017           32     -99999   Rain
5  1/6/2017           31          2  Sunny
6  1/6/2017           34          5      0

In [228]:
df.replace({'temperature':-99999,
            'windspeed':7,
            'event':'0'},np.nan)

        day  temperature  windspeed  event
0  1/1/2017         32.0        6.0   Rain
1  1/2/2017          NaN        NaN  Sunny
2  1/3/2017         28.0   -99999.0   Snow
3  1/4/2017          NaN        NaN    NaN
4  1/5/2017         32.0   -99999.0   Rain
5  1/6/2017         31.0        2.0  Sunny
6  1/6/2017         34.0        5.0    NaN

In [229]:
df.replace({'temperature':-99999,
            'windspeed':7,
            'event':'0'},
          {'temperature':100,
            'windspeed':200,
            'event':'no event'})

        day  temperature  windspeed     event
0  1/1/2017           32          6      Rain
1  1/2/2017          100        200     Sunny
2  1/3/2017           28     -99999      Snow
3  1/4/2017          100        200  no event
4  1/5/2017           32     -99999      Rain
5  1/6/2017           31          2     Sunny
6  1/6/2017           34          5  no event

In [232]:
df['temperature'].unique()    #displays all the unique datas

array([    32, -99999,     28,     31,     34], dtype=int64)

In [233]:
df['event'].unique()

array(['Rain', 'Sunny', 'Snow', '0'], dtype=object)

In [235]:
df['new_temp']=df['temperature'].apply(lambda x:100 if x>28 else x)

In [236]:
df

        day  temperature  windspeed  event  new_temp
0  1/1/2017           32          6   Rain       100
1  1/2/2017       -99999          7  Sunny    -99999
2  1/3/2017           28     -99999   Snow        28
3  1/4/2017       -99999          7      0    -99999
4  1/5/2017           32     -99999   Rain       100
5  1/6/2017           31          2  Sunny       100
6  1/6/2017           34          5      0       100

In [237]:
np.where(df['temperature']>28)

(array([0, 4, 5, 6], dtype=int64),)

## group by

In [245]:
df=pd.read_csv('datasets/weather_by_cities_group_by.csv')

In [246]:
df

         day      city  temperature  windspeed   event
0   1/1/2017  new york           32          6    Rain
1   1/2/2017  new york           36          7   Sunny
2   1/3/2017  new york           28         12    Snow
3   1/4/2017  new york           33          7   Sunny
4   1/1/2017    mumbai           90          5   Sunny
5   1/2/2017    mumbai           85         12     Fog
6   1/3/2017    mumbai           87         15     Fog
7   1/4/2017    mumbai           92          5    Rain
8   1/1/2017     paris           45         20   Sunny
9   1/2/2017     paris           50         13  Cloudy
10  1/3/2017     paris           54          8  Cloudy
11  1/4/2017     paris           42         10  Cloudy

In [247]:
#what is the maximum temperature of each cities/minimum temperature/mean temperature of each cities

In [248]:
df1=df.groupby('city')

In [249]:
list(df1)

[('mumbai',
          day    city  temperature  windspeed  event
  4  1/1/2017  mumbai           90          5  Sunny
  5  1/2/2017  mumbai           85         12    Fog
  6  1/3/2017  mumbai           87         15    Fog
  7  1/4/2017  mumbai           92          5   Rain),
 ('new york',
          day      city  temperature  windspeed  event
  0  1/1/2017  new york           32          6   Rain
  1  1/2/2017  new york           36          7  Sunny
  2  1/3/2017  new york           28         12   Snow
  3  1/4/2017  new york           33          7  Sunny),
 ('paris',
           day   city  temperature  windspeed   event
  8   1/1/2017  paris           45         20   Sunny
  9   1/2/2017  paris           50         13  Cloudy
  10  1/3/2017  paris           54          8  Cloudy
  11  1/4/2017  paris           42         10  Cloudy)]

In [250]:
data=df.groupby('city')

In [252]:
data.get_group('mumbai')

        day    city  temperature  windspeed  event
4  1/1/2017  mumbai           90          5  Sunny
5  1/2/2017  mumbai           85         12    Fog
6  1/3/2017  mumbai           87         15    Fog
7  1/4/2017  mumbai           92          5   Rain

In [253]:
data.get_group('new york')

        day      city  temperature  windspeed  event
0  1/1/2017  new york           32          6   Rain
1  1/2/2017  new york           36          7  Sunny
2  1/3/2017  new york           28         12   Snow
3  1/4/2017  new york           33          7  Sunny

In [254]:
data.mean()

          temperature  windspeed
city
mumbai          88.50       9.25
new york        32.25       8.00
paris           47.75      12.75

In [255]:
data.min()

               day  temperature  windspeed   event
city
mumbai    1/1/2017           85          5     Fog
new york  1/1/2017           28          6    Rain
paris     1/1/2017           42          8  Cloudy

In [256]:
data.max()

               day  temperature  windspeed  event
city
mumbai    1/4/2017           92         15  Sunny
new york  1/4/2017           36         12  Sunny
paris     1/4/2017           54         20  Sunny

In [257]:
data.min()['temperature']

city
mumbai      85
new york    28
paris       42
Name: temperature, dtype: int64